
*** Pomodoro
#+begin_src emacs-lisp
(pd/package-install 'org-pomodoro)
;; Needs terminal-notifier (brew install terminal-notifier)
(defun notify-osx (title message)
(call-process "terminal-notifier"
nil 0 nil
"-group" "Emacs"
"-title" title
"-sender" "org.gnu.Emacs"
"-message" message))
;; org-pomodoro mode hooks
(add-hook 'org-pomodoro-finished-hook
(lambda ()
(notify-osx "Pomodoro completed!" "Time for a break.")))
 
(add-hook 'org-pomodoro-break-finished-hook
(lambda ()
(notify-osx "Pomodoro Short Break Finished" "Ready for Another?")))
 
(add-hook 'org-pomodoro-long-break-finished-hook
(lambda ()
(notify-osx "Pomodoro Long Break Finished" "Ready for Another?")))
 
(add-hook 'org-pomodoro-killed-hook
(lambda ()
(notify-osx "Pomodoro Killed" "One does not simply kill a pomodoro!"))) 
#+end_src

#+RESULTS:
| lambda | nil | (notify-osx Pomodoro Killed One does not simply kill a pomodoro!) |

